# В единственной строке записан текст.
# Для каждого слова из данного текста подсчитайте, сколько раз оно встречалось в этом тексте ранее.
# Словом считается последовательность непробельных символов, идущих подряд.
# Слова разделены одним или большим числом пробелов или символами конца строки.
dict1= ['кот','собака','привет','кот','собака','кот','дверь']
n = 0
summ = 0
summ1 = 0
summ2 = 0
summ3 = 0
for n in dict1:
    if n == 'кот':
        summ += 1
print('Слово кот встречается',summ,'раз(а)')
for n in dict1:
    if n == 'собака':
        summ1 += 1
print('Слово собака встречается',summ1,'раз(а)')
for n in dict1:
    if n == 'дверь':
        summ2 += 1
print('Слово дверь встречается',summ2,'раз(а)')
for n in dict1:
    if n == 'привет':
        summ3 += 1
print('Слово привет встречается',summ3,'раз(а)')

