#Найти сумму элементов, находящихся между минимальным и максимальным элементами.
#Сами минимальный и максимальный элементы в сумму не включать.
min_ = int(input())
max_ = int(input())
sum_ = 0
for i in range(min_+1,max_):
  sum_ += i
print('Сумма элементов цикла - ', sum_)

