#Известны год, номер месяца и день рождения каждого из двух человек.
#Определить, кто из них старше.
p1= int(input('Введите год рождения первого человека: '))
e1 = int(input('Введите месяц рождения первого человека: '))
r1 = int(input('Введите день рождения первого человека: '))
p2 = int(input('Введите год рождения второго человека: '))
e2 = int(input('Введите месяц рождения второго человека: '))
r2 = int(input('Введите день рождения второго человека: '))
if p1<p2:
    if e1<=e2:
        if r1<=r2:
            print('Человек №1 старше')
else:
    print('Человек №2 старше')