#Написать функцию, которая определяет количество разрядов введённого целого числа.
str1 = input('Введите кол-во десятков: ')
str2 = input('Введите кол-во единиц: ')
def chislo(str1,str2):
    dict1 = {'десятки':str1,
             'единицы':str2}
    return dict1
print(chislo(str1,str2))