#Вывести на экран ряд натуральных чисел от минимума до максимума с шагом.
#Например, если минимум 10, максимум 35, шаг 5, то вывод должен быть таким: 10 15 20 25 30 35.
#Минимум, максимум и шаг указываются пользователем (считываются с клавиатуры).
print(*range(int(input('Введите минимум')), int(input('Введите максимум'))+1, int(input('Введите шаг'))))
